{
  "questions": [
    {
      "id": 11,
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "In which school did Obama's wife study?",
          "keywords": "school, Obama's wife, study"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q76> <http://www.wikidata.org/prop/direct/P26>/<http://www.wikidata.org/prop/direct/P69> ?uri}"
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q7996715"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q21578"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q49122"
                }
              }
            ]
          }
        }
      ]
    },
    {
      "id": 38,
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Show me all books in Asimov's Foundation series.",
          "keywords": "books, Asimov, Foundation series"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q1564644> <http://www.wikidata.org/prop/direct/P527> ?uri }"
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
               {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q913482"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q753894"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q783533"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q839800"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q853927"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q932592"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q938629"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q1050014"
                }
              }
            ]
          }
        }
      ]
    },
    {
      "id": 53,
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me a list of all Canadians that reside in the U.S.",
          "keywords": "list, Canadians, residing in the U.S."
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P19>/<http://www.wikidata.org/prop/direct/P17>  <http://www.wikidata.org/entity/Q16> . ?uri <http://www.wikidata.org/prop/direct/P551>  <http://www.wikidata.org/entity/Q30> . }"
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q3383077"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q323316"
                }
              }
            ]
          }
        }
      ]
    },
    {
      "id": 73,
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Show me the book that Muhammad Ali wrote.",
          "keywords": "book, wrote, Muhammad Ali"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q571> . ?uri <http://www.wikidata.org/prop/direct/P50> <http://www.wikidata.org/entity/Q36107> . }"
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q7765371"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q24963339"
                }
              }
            ]
          }
        }
      ]
    },
    {
      "id": 84,
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all soccer clubs in the Premier League.",
          "keywords": "Premier League, soccer club"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q476028> . ?uri <http://www.wikidata.org/prop/direct/P118> <http://www.wikidata.org/entity/Q9448> . }"
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q1023125"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q1130849"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q2714"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q5794"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q9616"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q9617"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q18659"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q18656"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q18661"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q18711"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q18723"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q18732"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q18739"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q18736"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q18741"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q18747"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q18744"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q19458"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q19467"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q19477"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q19481"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q19568"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q50602"
                }
              }
            ]
          }
        }
      ]
    },
    {
      "id": 85,
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Show me all museums in London.",
          "keywords": "museums, London"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q33506> . ?uri <http://www.wikidata.org/prop/direct/P276> <http://www.wikidata.org/entity/Q84> . }"
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q4956083"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q4064609"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q2002512"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q644281"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q55075068"
                }
              }
            ]
          }
        }
      ]
    },
    {
      "id": 86,
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all South American countries.",
          "keywords": "countries, South American"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q6256> . ?uri <http://www.wikidata.org/prop/direct/P30> <http://www.wikidata.org/entity/Q18> . }"
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q298"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q414"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q419"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q717"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q734"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q733"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q739"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q736"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q750"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q77"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q155"
                }
              }
            ]
          }
        }
      ]
    },
    {
      "id": 90,
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Show me Hemingway's autobiography.",
          "keywords": "autobiography, Hemingway"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P50> <http://www.wikidata.org/entity/Q23434> . ?uri <http://www.wikidata.org/prop/direct/P136> <http://www.wikidata.org/entity/Q4184> . }"
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://www.wikidata.org/entity/Q2052363"
                }
              }
            ]
          }
        }
      ]
    }
  ],
  "dataset": {
    "id": "qald-7-train-en-wikidata"
  }
}
